//ATTCHTRY JOB
//STEP    EXEC ASMACLG
//*.SYSIN   DD DSN=MELEN.SRC(ATTCHTRY),DISP=SHR
//C.SYSIN   DD DSN=MELEN.SRC(RDJCB),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//G.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE   DD DSN=MELEN.DATA.ESORT.IN1,DISP=SHR
//G.OUTFILE DD SYSOUT=*
