//CPP      JOB
//STEP1   EXEC ASMACLG,PARM.G=''
//C.SYSIN   DD DSN=MELEN.SRC(CPP),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
