//SMPLDALC JOB
//STEP    EXEC ASMACLG,PARM.G='MELEN.TEST2.DS'
//C.SYSIN   DD DSN=MELEN.SRC(SMPLDALC),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=SYS1.MODGEN,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
//*.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE  DD *
7
17
11
25
63
19
17
14
/*
//G.OUTFILE DD SYSOUT=*
