//DLIST5 JOB
//STEP    EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.DATA.ESORT.IN1,DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//G.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE   DD DSN=MELEN.DATA.ESORT.IN1,DISP=SHR
//*.SYSUDUMP DD SYSOUT=*
//G.OUTFILE DD SYSOUT=*
