//DLIST   JOB
//STEP    EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.SRC(DLIST),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//G.INFILE  DD *
2
-2
-1
23
14
258
/*
//G.OUTFILE DD SYSOUT=*
