//ESORT   JOB
//        EXEC  ASMACLG
//C.SYSIN    DD DSN=MELEN.SRC(ESORT),DISP=SHR
//G.INFILE   DD DSN=MELEN.DATA.ESORT.IN1,DISP=SHR
//G.OUTFILE  DD SYSOUT=*
