//EASYJOB JOB
//STEP01  EXEC PGM=IEFBR14
//MYFILE  DD   DSN=MELEN.TEST.SEQ2,DISP=(NEW,CATLG,DELETE),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=320),
//             SPACE=(CYL,(80,15))
