//GTFPARSE JOB
//R       EXEC PGM=IKJEFT01,PARM='GTFPARSE'  PARM='GTFPARSE'
//SYSEXEC  DD  DSN=MELEN.REXX.EXEC,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  DUMMY
//GTFFILE  DD  DSN=MELEN.MHUT.GTFTRACE,DISP=SHR
