//IFCEREP1 JOB (001),'EREP LOG UTILITY',
//             CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A
//IFCEREP1 EXEC PGM=IFCEREP1,REGION=1024K,PARM='CARD'
//SERLOG   DD  DSN=SYS1.LOGREC,DISP=OLD
//ACCDEV   DD  DUMMY
//TOURIST  DD  SYSOUT=A
//EREPPT   DD  SYSOUT=A
//SYSIN    DD  *
  LINECT=060
  TABSIZE=512K
  PRINT=AL
  HIST=N
  ZERO=N
  ACC=N
//
