//ISPDTLC1 JOB
//*
//ISPDTLC EXEC PGM=IKJEFT01
//SYSEXEC  DD DSN=ISP.SISPEXEC,DISP=SHR
//ISPPROF  DD RECFM=FB,LRECL=80,SPACE=(TRK,(1,1,2))
//ISPMLIB  DD DSN=ISP.SISPMENU,DISP=SHR
//ISPPLIB  DD DSN=ISP.SISPPENU,DISP=SHR
//ISPSLIB  DD DSN=ISP.SISPSENU,DISP=SHR
//ISPTLIB  DD DSN=ISP.SISPTENU,DISP=SHR
//DTLGML   DD DSN=MELEN.ISPF.GML,DISP=SHR           SOURCES HERE
//DTLMSG   DD DSN=MELEN.ISPF.MSGS,DISP=OLD
//DTLPAN   DD DSN=MELEN.ISPF.PANELS,DISP=OLD
//DTLTAB   DD DSN=MELEN.ISPF.TABLES,DISP=OLD
//ISPLOG   DD SYSOUT=*,RECFM=FB,LRECL=133
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSIN DD *
ISPSTART CMD(%ISPDTLC DACFMODS +
             (REPLACE DISK KEYLAPPL=ISR +
              NOPREP STATS PROFDDN=* +
)
//*
