//J2107N2 JOB
//DELPMEM  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//PDS      DD DSN=MELEN.SRC,DISP=SHR
//SYSIN    DD *
  DELETE 'MELEN.SRC(TEST11)' FILE(PDS)
/*
