//J2107N1 JOB
//STEP1    EXEC PGM=IEBGENER
//SYSUT1   DD   DUMMY,RECFM=FB,LRECL=80
//SYSUT2   DD   DSN=MELEN.SRC(TEST11),DISP=(SHR)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   DUMMY
