//ASDSA    JOB
//G       EXEC PGM=IKJEFT1A
//G.STEPLIB    DD  DSN=MELEN.LOADLIB,DISP=SHR
//             DD DSN=SYS1.LINKLIB,DISP=SHR
//G.SYSTSPRT DD   SYSOUT=*
//G.SYSIN    DD   DUMMY
//G.SYSOUT   DD   SYSOUT=*
//G.SYSTSIN  DD   *
 LISTDS 'MLN1.LINKLIB'
/*
