//***** COMPILE SVC AND SVC UPDATE ********
//MHUTPSVC JOB
//MHTSVC   EXEC ASMACL,
//             PARM.L='MAP,LET,LIST,NCAL,AC=1'
//C.SYSIN   DD DSN=MELEN.SRC(MHUTSVCS),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MODGEN,DISP=SHR
//L.SYSLMOD DD DISP=(MOD,CATLG),DSN=MELEN.LOADLIB1(MHUTSVCS)
//************************
//MHTSVCG  EXEC PGM=MHUTSVCS
//G.STEPLIB DD DSN=MELEN.LOADLIB1,DISP=SHR
