//MYESTAET JOB
//STEP1   EXEC ASMACLG,PARM.G='LIST'
//C.SYSIN   DD DSN=MELEN.SRC(MYESTAET),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
