//MYSORT   JOB
//        EXEC  ASMACLG
//C.SYSIN    DD DSN=MELEN.SRC(MYSORT),DISP=SHR
//G.INFILE   DD DSN=MELEN.DATA.SORT.IN1,DISP=SHR
//G.OUTFILE  DD SYSOUT=*
