//NEWKSDS JOB
//DEFINE EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
 DEFINE CLUSTER (NAME(MELEN.TEST.VSAM1) -
 INDEXED -
 CYLINDERS(8 8) -
 LOG(NONE) -
 STORCLAS(NORMALG) -
 KEYS(8 0) -
 VOLUMES(ZAIMS1) -
 CISZ(18324) -
 SHR(2 3) -
 RECORDSIZE(112 112))
/*
