//NUMBSJOB JOB
//        EXEC  ASMACLG,PARM.G='42'
//C.SYSIN    DD DSN=MELEN.SRC(NUMS2),DISP=SHR
//C.SYSLIB   DD DSN=MELEN.MACLIB,DISP=SHR
//           DD DSN=SYS1.MACLIB,DISP=SHR
//G.OUTFILE  DD SYSOUT=*
