//QSORT   JOB
//STEP    EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.SRC(QSORT),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//*.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE  DD *
7
17
11
25
63
19
17
14
/*
//G.OUTFILE DD SYSOUT=*
