//RDJFCB  JOB
//STEP    EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.SRC(RDJCB),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//C.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE  DD DSN=MLN1.LINKLIB,DISP=SHR
//G.OUTFILE DD SYSOUT=*
