//STRTOINT JOB
//        EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.SRC(STRTOINT),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//G.INFILE  DD *
9
4
4
5
1
7
/*
//G.OUTFILE DD SYSOUT=*
