//TRYCALL JOB
//STEP    EXEC ASMACLG
//C.SYSIN   DD DSN=MELEN.SRC(TRYCALL),DISP=SHR
//C.SYSLIB  DD DSN=MELEN.MACLIB,DISP=SHR
//          DD DSN=SYS1.MACLIB,DISP=SHR
//G.STEPLIB DD DSN=MELEN.LOADLIB,DISP=SHR
//G.INFILE  DD *
1
2
3
/*
//G.OUTFILE DD SYSOUT=*
