//TRYPERC  JOB
//         SET DOCOMP=N
//*         IF &DOCOMP=Y THEN
//STEP1   EXEC ASMACL
//C.SYSIN   DD DSN=MELEN.SRC(TRYPER1),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
//L.SYSLMOD DD DISP=(MOD,CATLG),UNIT=SYSDA,DSN=MELEN.LOADLIB1
//L.SYSIN   DD *
      NAME  TRYPER1(R)
/*
//*         ELSE
//*         ENDIF
//STEPG   EXEC PGM=TRYPER1
//STEPLIB   DD DSN=MELEN.LOADLIB1,DISP=SHR
