//TRYPERN3 JOB
//         SET DOCOMP=N
//STEP1   EXEC ASMACL
//C.SYSIN   DD DSN=MELEN.SRC(TRYPERT1),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
//L.SYSLMOD DD DISP=(MOD,CATLG),UNIT=SYSDA,DSN=MELEN.LOADLIB1
//L.SYSIN   DD *
      NAME  TRYPERT1(R)
/*
//STEP2   EXEC ASMACL
//C.SYSIN   DD DSN=MELEN.SRC(TRYPERN3),DISP=SHR
//C.SYSLIB  DD DSN=SYS1.MACLIB,DISP=SHR
//          DD DSN=MELEN.MACLIB,DISP=SHR
//L.SYSLMOD DD DISP=(MOD,CATLG),UNIT=SYSDA,DSN=MELEN.LOADLIB1
//L.SYSIN   DD *
      NAME  TRYPERN3(R)
/*
//STEPG   EXEC PGM=TRYPERN3
//STEPLIB   DD DSN=MELEN.LOADLIB1,DISP=SHR
