//VVSM    JOB
//STEP020 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//OUTDD1   DD DSN=MELEN.TEST.VSAM1,DISP=SHR
//SYSIN DD *
 PRINT INFILE(OUTDD1) CHARACTER
/*
//
//STEP010 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD1    DD DSN=MELEN.TEST.SRC,DISP=SHR
//OUTDD1   DD DSN=MELEN.TEST.VSAM1,DISP=MOD
//SYSIN DD *
 REPRO INFILE(INDD1) OUTFILE(OUTDD1)
/*
