//EASYJOB JOB
//STEP01  EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1  DD   *
HELLO
/*
//SYSUT2  DD   DSN=MELEN.TEST.SEQ2,DISP=(NEW,CATLG,DELETE),
//             DCB=(DSORG=PS,RECFM=FB,LRECL=80,BLKSIZE=320),
//             SPACE=(CYL,(80,15))
//SYSIN   DD   DUMMY
