/* REXX */
ISPTABLDS = 'MELEN.ISPF.TABLES'
ADDRESS ISPEXEC
"LIBDEF ISPTABL DATASET ID('"ISPTABLDS"')"
"TBCREATE TABLE1 KEYS(EMPSER) NAMES(AAA XNAME XADDR XPHONE) WRITE"
DO I = 1 TO 2 BY 1
  AAA = '1'
  EMPSER ='172397'||I
  XNAME ='XNAME1'
  XADDR ='XADDR1'
  XPHONE = '547-8465'
  "ISPEXEC TBADD TABLE1"
END
"ISPEXEC TBCLOSE TABLE1"
"ISPEXEC LIBDEF ISPTLIB"
/**********************/
"LIBDEF ISPPLIB DATASET ID('MELEN.ISPF.PANELS')"
"LIBDEF ISPTLIB DATASET ID('"ISPTABLDS"')"
"TBOPEN TABLE1 SHARE"
SAY "RC2#"RC
"TBVCLEAR TABLE1"
AAA = '1'
 /*'TBSARG TABLE1 NEXT NAMECOND(AAA,EQ)'  */
SAY "RC3#"RC
SAY "RC1#"RC
"TBTOP TABLE1"
'TBDISPL TABLE1 PANEL(DACFMODS) ROWID(TBCRP)'
TDSELS = ZTDSELS
SAY 'TD'TDSELS'TB'TBCRP
"ISPEXEC TBCLOSE TABLE1"
"LIBDEF ISPTLIB"
"LIBDEF ISPPLIB"
