//GCCGEN   JOB CLASS=C,REGION=0K
//*
//* NOTE THAT BY NATURE, THE FILE FROM THE PC IS IN AN
//* UNDEFINED FORMAT, SINCE IT'S CONTENTS COULD BE
//* ANYTHING. WE KNOW IT IS IN XMIT FORMAT THOUGH, BUT
//* THE GENERIC TAPE SETUP FACILITY DOESN'T KNOW THAT
//* UNLESS YOU SPECIFICALLY TELL IT. THIS PROCEDURE
//* ASSUMES IT IS STILL IN UNDEFINED FORMAT, AND THAT
//* THIS PROGRAM (COPYFILE, RATHER THAT IEBGENER), WILL
//* REFORM IT INTO AN FB80.
//*
//* ALSO NOTE THAT THE USE OF COPYFILE IS JUST AN EXAMPLE
//* OF ASSISTED FILE TRANSFER ON ONE SYSTEM. THERE'S A
//* VERY GOOD CHANCE THAT YOU WON'T EVEN HAVE THE COPYFILE
//* PROGRAM UNLESS YOU HAVE PREVIOUSLY INSTALLED AN OLDER
//* VERSION OF GCC.
//*
//TRANSFER PROC GCCPREF='GCC' ,PDPPREF='PDPCLIB'
//*
//COPY     EXEC PGM=COPYFILE,PARM='-BB DD:IN DD:OUT'
//*STEPLIB  DD DSN=&PDPPREF..LINKLIB,DISP=SHR
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
//IN       DD DSN=&GCCPREF..GCC.PDS.XMIT(GCCMVS),DISP=OLD,
//         UNIT=TAPE,VOL=SER=PCTOMF,LABEL=(1,NL),
//         DCB=(RECFM=U,LRECL=0,BLKSIZE=6233)
//OUT      DD DSN=&GCCPREF..GCC.SEQ.XMIT,DISP=OLD
//SYSIN    DD DUMMY
//SYSPRINT DD SYSOUT=*
//SYSTERM  DD SYSOUT=*
//         PEND
//*
//S1 EXEC TRANSFER
//
