//GCCGEN   JOB CLASS=C,REGION=0K
//*
//* RECEIVE THE XMIT. ADJUST THE HLQS APPROPRIATELY.
//*
//RECV1    PROC
//*
//RECV     EXEC PGM=IKJEFT01,DYNAMNBR=60
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  DUMMY
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=121,BLKSIZE=12100)
//SYSTERM  DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//SYSIN    DD  DUMMY
//*
//         PEND
//*
//S1 EXEC RECV1
//SYSTSIN  DD  *
PROFILE PREFIX(GCC)
RECEIVE INDSNAME('GCC.GCC.SEQ.XMIT')

LISTC
/*
//*
//
